{
    "rackErrID": "The rack in this change plan step does not exist.",
    "datacenterErrID": "The datacenter in this change plan step does not exist.",
    "rackUConflictDBErrID": "An asset at this rack U conflicts with other asset(s) on the rack.",
    "rackUConflictStepErrID": "An asset at this rack U conflicts with other asset(s) on the rack placed in an earlier step.",
    "ownerErrID": "The owner for this asset does not exist.",
    "hostnameDBErrID": "The hostname in this change plan step is already taken.",
    "hostnameStepErrID": "The hostname in this change plan step is already taken in a previous step.",
    "assetIDDBErrID": "The asset ID in this change plan step is already taken.",
    "assetIDStepErrID": "The asset ID in this change plan step is already taken in a previous step.",
    "modelErrID": "The model in this change plan step does not exist.", 
    "powerConnectionConflictDBErrID": "The power connections in this change plan step are connected to one or more power ports that are already occupied.",
    "powerConnectionConflictStepErrID": "The power connections in this change plan step are connected to one or more power ports that are already occupied in a previous step.",
    "powerConnectionsInvalidPortErrID": "The power connections in this change plan step have an invalid port number.",
    "networkConnectionNonExistentOtherPortDBErrID": "The network connections in this change plan step is trying to connect to a nonexistent port on another asset.",
    "networkConnectionNonExistentOtherPortStepErrID": "The network connections in this change plan step is trying to connect to a port on another asset that no longer exists due to an earlier step.",
    "networkConnectionNonExistentThisPortErrID": "The network connections in this change plan step is trying to connect a nonexistent port on this asset.",
    "networkConnectionConflictDBErrID": "The network connections in this change plan step contain one or more ports that are already occupied.",
    "networkConnectionConflictStepErrID": "The network connections in this change plan step contain one or more ports that are already occupied due to a previous step.",
    "networkConnectionOtherAssetIDDBErrID": "The network connections in this change step plan are trying to connect to a nonexistent asset.",
    "networkConnectionOtherAssetIDStepErrID": "The network connections in this change step plan are trying to connect to an asset that no longer exist due to a previous step.",
    "networkConnectionThisPortConflictErrID": "This step's network connection conflicts on This Port",

    "decommissionDBErrID": "Trying to edit or decommission an asset that does not exist.",
    "decommissionStepErrID": "Trying to edit or decommission an asset that was decommissioned in a previous step",


    "editNonexistentErrID": "Trying to edit an asset that no longer exists.",

    "chassisErrID": "The chassis this blade belongs to does not exist."


    
}